print(300, "김보성입니다")
print("300"+" "+"김보성입니다")
a    = 300
name = "홍길동"
print(a, name)
a    = "김길동"
print(a)
a    = "김길동"
b    = '김보성'
c    = """
구름에 달 가듯이
가는 나그네
"""
print(a, b, c)
a    = '"반갑습니다"라고 말함'
a    = "'반갑습니다' 라고 말함"
a    = "\"반갑습니다\" 라고 말함" #따옴표 앞에 붙일것, 가장 통상적
print(a)
print("안녕~\n하세요") # 줄바꿈
print("안녕하세요\t안녕하세요") # 탭 - 표 형식 표현 유용
print("안녕하세요\\") 
print("안녕하세요"[0])
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])
a    = "안녕하세요"
print(a[0])
print(a[1])
print(a[2])
print(a[3])
print(a[4])
print(a[0], a[1], a[2], a[3], a[4])
print("안녕하세요"[-1])
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])
print(a[-5], a[-4], a[-3], a[-2], a[-1])
print(a[-5]+a[-4]+a[-3]+a[-2]+a[-1])
